"""n=int(input())

if n % 2 == 0:
    print(n, "- парне")

if n % 10 == 0:
    print(n, "Остання цифра нуль")

if 9<n<100:
    d1 = n//10
    d2 = n%10
    s = d1 + d2
    if 9 < s < 100:
        print (n, "-задовільняє умову с")"""

n=int(input())
d1=n//100
d2=n//10%10
d3=n%10

if 99<n<1000:
    if d1 == 2 or d2 == 2 or d3 == 2:
        print(n, "- містить цифру 2")

if 99<n<1000:
    if d1 % 2 ==0 and d2 % 2==0 and d3 % 2==0:
        print(n, "- містить всі парні числа")

if 99<n<1000:
    if d1 + d2 + d3 == 18:
        print(n, "-сума цого чисел дорівнює 18")